
[[Static-UnguardedInsert]]
# UnguardedInsert
:concept: Static/UnguardedInsert

.Synopsis
An `insert` occurs outside a `visit` expression.

.Syntax

.Types

.Function
       
.Usage

.Description
An insert statement may only occur in the action part of a link:{RascalLang}#Patterns-PatternWithAction[pattern with action], 
more precisely in a case in a 
link:{RascalLang}#Expressions-Visit[visit] expression. 

Remedies:

*  Use an auxiliary variable and list or set operations to insert the value where you want.
*  Place the insert statement inside a visit.

.Examples
Here is an example of the use of insert to swap the arguments of red nodes:
[source,rascal-shell-error]
----
----
Our favorite data type, colored trees:
[source,rascal-shell-error]
----
rascal>data CTree = leaf(int n) | red(CTree left, CTree right) | green(CTree left, CTree right);
ok
----
An example tree:
[source,rascal-shell-error]
----
rascal>CTree T = red(green(leaf(1), red(leaf(2), leaf(3))), red(leaf(4), leaf(5)));
CTree: red(
  green(
    leaf(1),
    red(
      leaf(2),
      leaf(3))),
  red(
    leaf(4),
    leaf(5)))
----
A visit to swap the arguments of red nodes:
[source,rascal-shell-error]
----
rascal>visit(T){ case red(CTree l, CTree r): insert red(r,l); }
CTree: red(
  red(
    leaf(5),
    leaf(4)),
  green(
    leaf(1),
    red(
      leaf(3),
      leaf(2))))
----
An error occurs when insert is used outside a visit:
[source,rascal-shell-error]
----
rascal>insert red(leaf(1), leaf(2));
[error] Cannot insert outside the scope of a visit IN 'insert red(leaf(1), leaf(2));'
----

.Benefits

.Pitfalls


:leveloffset: +1

:leveloffset: -1