
[[statistics-Frequency]]


[[statistics-Frequency]]
# Frequency
:concept: analysis/statistics/Frequency
.Usage
`import analysis::statistics::Frequency;`



.Synopsis
Frequency distributions.

.Description

The following functions are provided:



* <<Frequency-cumFreq,cumFreq>>: Cumulative frequency of values less than or equal to a given value.
      
* <<Frequency-cumPct,cumPct>>: Cumulative percentage of values less than or equal to a given value.
      
* <<Frequency-distribution,distribution>>: Compute a distribution: count how many times events are mapped to which bucket.
      
* <<Frequency-pct,pct>>: Percentage of values that are equal to a given value.
      

[[Frequency-cumFreq]]
## cumFreq

.Function 
* `int cumFreq(list[value] values, num n)`
          * `int cumFreq(list[value] values, str s)`
          


.Synopsis
Cumulative frequency of values less than or equal to a given value.

.Description

Returns the cumulative frequency of values less than or equal to a given numeric or string value.
Returns 0 if the value is not comparable to the values set.

.Examples

[source,rascal-shell]
----
rascal>import analysis::statistics::Frequency;
rascal2rvm: Parsing and checking |std:///analysis/statistics/Frequency.rsc|
rascal2rvm: Compiling |std:///analysis/statistics/Frequency.rsc|
r2mu: entering ... analysis::statistics::Frequency
rlib1 = analysis.statistics.Frequencies, rlib2 = |std:///analysis/statistics/FrequenciesCompiled.class|
resolveLibOverriding org.rascalmpl.library.analysis.statistics.Frequencies => org.rascalmpl.library.analysis.statistics.Frequencies
mu2rvm: Compiling module analysis::statistics::Frequency
Compiling |std:///analysis/statistics/Frequency.rsc|: check: 17, compile: 345, total: 362 ms
compile: Writing RVMModule |compressed+home:///bin-console/analysis/statistics/Frequency.rvm.gz|
Removing |compressed+home:///bin-console/ConsoleInput_imports.rvm.gz|
ok
rascal>
>>>>>>>D = [1, 2, 1, 1, 3, 5];
list[int]: [1,2,1,1,3,5]
rascal>cumFreq(D, 1);
int: 3
rascal>cumFreq(D, 2);
int: 4
rascal>cumFreq(D, 10);
int: 6
----



[[Frequency-cumPct]]
## cumPct

.Function 
* `num cumPct(list[value] values, num n)`
          * `num cumPct(list[value] values, str s)`
          


.Synopsis
Cumulative percentage of values less than or equal to a given value.

.Description
Returns the cumulative percentage of values less than or equal to v (as a proportion between 0 and 1).

[source,rascal-shell]
----
rascal>import analysis::statistics::Frequency;
ok
rascal>D = [1, 2, 1, 1, 3, 5];
list[int]: [1,2,1,1,3,5]
rascal>cumPct(D, 1);
real: 0.5
rascal>cumPct(D, 2);
real: 0.6666666666666666
rascal>cumPct(D, 10);
real: 1.0
----



[[Frequency-distribution]]
## distribution

.Function 
* `map[&T, int] distribution(rel[&U event, &T bucket] input)`
          * `map[&T <: num, int] distribution(rel[&U event, &T <: num bucket] input, &T <: num bucketSize)`
          * `map[&T, int] distribution(map[&U event, &T bucket] input)`
          * `map[&T <: num, int] distribution(map[&U event, &T <: num bucket] input, &T <: num bucketSize)`
          


.Synopsis
Compute a distribution: count how many times events are mapped to which bucket.

.Examples
[source,rascal-shell]
----
rascal>import analysis::statistics::Frequency;
ok
rascal>distribution({<"chicken","animal">,<"bear","animal">,<"oak","plant">,<"tulip","plant">});
map[str, int]: ("plant":2,"animal":2)
rascal>distribution({<"alice",2>,<"bob",3>,<"claire",5>},5);
map[int, int]: (5:2,0:1)
----



[[Frequency-pct]]
## pct

.Function 
* `num pct(list[value] values, num n)`
          * `num pct(list[value] values, str s)`
          


.Synopsis
Percentage of values that are equal to a given value.

.Description
Returns the percentage of values that are equal to v (as a proportion between 0 and 1).
.Examples
[source,rascal-shell]
----
rascal>import analysis::statistics::Frequency;
ok
rascal>D = [1, 2, 1, 1, 3, 5];
list[int]: [1,2,1,1,3,5]
rascal>pct(D, 1);
real: 0.5
rascal>pct(D, 2);
real: 0.16666666666666666
rascal>pct(D, 10);
real: 0.0
----




:leveloffset: +1

:leveloffset: -1