[[ColorModel-colorNames]]
# colorNames
:concept: Vis/Figure/ColorModel/colorNames

.Synopsis
Sorted list of available color names that can be used by the [color] function.

.Syntax

.Types

.Function
`list[str] colorNames()`

.Description


.Examples
[source,rascal-shell]
----
rascal>import vis::Figure;
ok
rascal>colorNames();
list[str]: ["aliceblue","antiquewhite","aqua","aquamarine","azure","beige","bisque","black","blanchedalmond","blue","blueviolet","brown","burlywood","cadetblue","chartreuse","chocolate","coral","cornflowerblue","cornsilk","crimson","cyan","darkblue","darkcyan","darkgoldenrod","darkgray","darkgreen","darkgrey","darkkhaki","darkmagenta","darkolivegreen","darkorange","darkorchid","darkred","darksalmon","darkseagreen","darkslateblue","darkslategray","darkslategrey","darkturquoise","darkviolet","deeppink","deepskyblue","dimgray","dimgrey","dodgerblue","firebrick","floralwhite","forestgreen","fuchsia","gainsboro","ghostwhite","gold","goldenrod","gray","green","greenyellow","grey","honeydew","hotpink","indianred","indigo","ivory","khaki","lavender","lavenderblush","lawngreen","lemonchiffon","lightblue","lightcoral","lightcyan","lightgoldenrodyellow","lightgray","lightgreen","lightgrey","lightpink","lightsalmon","lightseagreen","lightskyblue","lightslategray","lightslategrey","lightsteelblue","lightyellow","lime","limegreen","linen","magenta","maroon","mediumaquamarine","mediumblue","mediumorchid","mediumpurple","mediumseagreen","mediumslateblue","mediumspringgreen","mediumturquoise","mediumvioletred","midnightblue","mintcream","mistyrose","moccasin","navajowhite","navy","oldlace","olive","olivedrab","orange","orangered","orchid","palegoldenrod","palegreen","paleturquoise","palevioletred","papayawhip","peachpuff","peru","pink","plum","powderblue","purple","red","rosybrown","royalblue","saddlebr...
----

This functions can be used to create color tables.
[source,rascal-shell]
----
rascal>render(hvcat(boxes, width(500), left()));
----


image::{concept}/c1.png[alt="colors"]


Or a color table with the color names in colored boxes:

[source,rascal-shell]
----
rascal>render(grid(split(boxes, 3))); 
----

image::{concept}/c3.png[alt="c3"]


.Benefits

.Pitfalls


:leveloffset: +1

:leveloffset: -1