
[[Func-Eval3]]
# Eval3
:concept: Languages/Func/Eval3

.Synopsis


.Syntax

.Types

.Function

.Description

Interpreter Eval3 supports the following features of Func: 


|====
| Feature              | Eval3

| function declaration | y
| integer constant     | y
| variable             | y
| arithmetic operators | y
| comparison operators | y
| call                 | y
| if                   | y
| let                  | y
| sequence             | y
| assignment           | y
| __address operator__ | y
| __dereference operator__ | y
|====



The main additions are the address and dereference operators.

.Examples
[source,rascal]
----
include::{LibDir}demo/lang/Func/Eval3.rsc[tags=module]
----

                

We apply `eval3` to example `F3`:
[source,rascal]
----
include::{LibDir}demo/lang/Func/programs/F3.func[]
----

                
Let's try this.
[source,rascal-shell]
----
rascal>import demo::lang::Func::Load;
ok
rascal>import demo::lang::Func::Eval3;
ok
rascal>import demo::lang::Func::programs::F3;
ok
rascal>eval3("fact", [10], load(F3));
tuple[list[int],int]: <[10],3628800>
----



.Benefits

.Pitfalls


:leveloffset: +1

:leveloffset: -1